import InfoCard from "./InfoCard";

const mockData = [
    {
        id: "1",
        title: "Уведомление с вх. № АО-5745/13.11.2024 г.",
        contractor: "Риосов-Русе",
        date: "13.11.2024",
        text: `В РИОСВ-Русе е внесено уведомление с вх. № АО-5745/13.11.2024 г. за инвестиционно предложение за „Увеличаване капацитета за 
        съхранение на неопасни торове на Складова база за съхранение на пакетирани минерални торове в с. Долна Студена, общ. Ценовоˮ, с 
        местоположение УПИ I-503, кв. 41 по плана на с. Долна Студена, общ. Ценов .и възложител „Лат Найтроджен Българияˮ ЕООД`,
    },
    {
        id: "2",
        title: "Уведомление с вх. № AO-57335/13.11.2024 г.",
        contractor: "Русе",
        date: "10.10.2023",
        text: `В Русе е внесено уведомление с вх. № AO-57335/13.11.2024 г. за инвестиционно предложение за „Промяна на технологичния процес
         в съществуваща инсталация за производство на хранителни продукти в с. Липник, общ. Ценовоˮ, с местоположение УПИ І-503, кв. 41 по 
         плана на с. Липник, общ. Ценово и възложител „Лат Найтроджен Българияˮ ЕООД`,
    },
];

const Home: React.FC = () => {
    return (
        <div className="flex flex-col items-center gap-6 my-6">
            {mockData.map((mock) => (
                <InfoCard key={mock.id} {...mock} />
            ))}
        </div>
    );
};

export default Home;
